_posts/technology/2022-06-17-cppcoreguidelines-f25.html
---
layout: post
title: CppCoreGuidelines F.25 用 zstring 或 not_null<zstring> 表示 C 风格字符串
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
理由
</p>

<p>
C 风格字符串很普遍。是一种惯例约定：空字符结尾的字符串数组。我们必须区分 C 风格字符串、指向单个字符的指针还是指向字符串数组的指针。
</p>

<p>
如果不需要 <code>null</code> 结尾，可以用 <code>string_view</code>
</p>

<p>
例子
</p>

<p>
考虑以下函数
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #0000ff; font-weight: bold;">length</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">char</span>* <span style="color: #000000;">p</span><span style="color: #707183;">)</span>;
</pre>
</div>

<p>
其他函数调用 <code>length(s)</code> 的时候，是否需要先检查 <code>s</code> 非空？还是在 <code>length()</code> 的函数的代码实现里会去检查确保参数非空？
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">the implementor of length() must assume that p == nullptr is possible</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #0000ff; font-weight: bold;">length</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">zstring</span> <span style="color: #000000;">p</span><span style="color: #707183;">)</span>;

<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">it is the caller's job to make sure p != nullptr</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #0000ff; font-weight: bold;">length</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">not_null</span><span style="color: #7388d6;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">zstring</span><span style="color: #7388d6;">&gt;</span> <span style="color: #000000;">p</span><span style="color: #707183;">)</span>;
</pre>
</div>

<p>
以上代码，前一个声明要求代码实现能够接受 p 是空指针的情况。第二个声明，则要求函数的调用方确保传进来的参数不能是空指针。
</p>


<p>
注意
</p>

<p>
<code>zstring</code> 不带所有权信息
</p>
